Catalogs/Организации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Организации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОрганизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ТипыОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыОрганизаций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальныйПредприниматель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Организации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ИзменениеВидимости()
	
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверкаИНН(СтрокаСИНН)
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") 
		И СтрДлина(СтрокаСИНН) = 10 
		ИЛИ Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель") 
		И СтрДлина(СтрокаСИНН) = 12 Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзменениеВидимости()
КонецПроцедуры


&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	Если НЕ ПроверкаИНН(Объект.ИНН) Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка. Длинна ИНН: ИП — 12 символов, для Юридического лица — 10", "Объект.ИНН");
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	ИзменениеВидимости();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ПроверкаИНН(Объект.ИНН)	Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Ошибка. Длинна ИНН: ИП — 12 символов, для Юридического лица — 10", "Объект.ИНН");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
